//------------------------------------------------------------------------------
// bird.c - содержит функции обработки птицы
//------------------------------------------------------------------------------

#include "bird.h"

//------------------------------------------------------------------------------
// Ввод параметров птицы из потока
int InBird(struct bird *b, FILE *ifst) {
    return fscanf(ifst, "%d %d %d", &t->a, &t->b, &t->c);
}

// Случайный ввод параметров птицы
void InRndBird(struct bird *b) {
    t->a = Random();
    t->b = Random();
    do {
        t->c = Random();
    } while((t->c >= (t->a + t->b))
          || (t->a >= (t->c + t->b))
          || (t->b >= (t->c + t->a)));
}

//------------------------------------------------------------------------------
// Вывод параметров птицы в поток
void OutBird(struct bird *b, FILE *ofst) {
    fprintf(ofst, "It is Triangle: a = %d, b = %d, c = %d. Perimeter = %lf \n", t->a, t->b, t->c,
            PerimeterTriangle(t));
}

//------------------------------------------------------------------------------
// Вычисление периметра птицы
double PerimeterTriangle(struct bird *t) {
    return t->a + t->b + t->c;
}
