//------------------------------------------------------------------------------
// fish.c - содержит процедуру ввода параметров
// для уже созданной рыбы
//------------------------------------------------------------------------------

#include "fish.h"

//------------------------------------------------------------------------------
// Ввод параметров рыбы из файла
int InFish(struct fish *f, FILE *ifst) {
    return fscanf(ifst, "%d %d", &r->x, &r->y);
}

// Случайный ввод параметров рыбы
void InRndFish(struct fish *f) {
    t->x = Random();
    t->y = Random();
}

//------------------------------------------------------------------------------
// Вывод параметров рыбы в форматируемый поток
void OutFish(struct fish *f, FILE *ofst) {
    fprintf(ofst, "It is Fish: x = %d, y = %d. Perimeter = %lf \n", r->x, r->y, PerimeterRectangle(r));
}

//------------------------------------------------------------------------------
// Вычисление периметра рыбы
double PerimeterRectangle(struct fish *f) {
    return 2.0 * (r->x + r->y);
}
