//------------------------------------------------------------------------------
// mammal.c - содержит процедуру ввода параметров
// для уже созданного прямоугольника
//------------------------------------------------------------------------------

#include "mammal.h"

//------------------------------------------------------------------------------
// Ввод параметров млекопитающего из файла
int InMammal(struct mammal *m, FILE *ifst) {
    return fscanf(ifst, "%d %d", &r->x, &r->y);
}

// Случайный ввод параметров млекопитающего
void InRndMammal(struct mammal *m) {
    t->x = Random();
    t->y = Random();
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void OutMammal(struct mammal *m, FILE *ofst) {
    fprintf(ofst, "It is Rectangle: x = %d, y = %d. Perimeter = %lf \n", r->x, r->y, PerimeterRectangle(r));
}
