//------------------------------------------------------------------------------
// rectangle_In.cpp - содержит процедуру ввода параметров 
// для уже созданного прямоугольника
//------------------------------------------------------------------------------

#include "rectangle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника из файла
int InRectangle(struct rectangle *r, FILE *ifst) {
    return fscanf(ifst, "%d %d", &r->x, &r->y);
}

// Случайный ввод параметров прямоугольника
void InRndRectangle(struct rectangle *t) {
    t->x = Random();
    t->y = Random();
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void OutRectangle(struct rectangle *r, FILE *ofst) {
    fprintf(ofst, "It is Rectangle: x = %d, y = %d. Perimeter = %lf \n", r->x, r->y, PerimeterRectangle(r));
}

//------------------------------------------------------------------------------
// Вычисление периметра прямоугольника
double PerimeterRectangle(struct rectangle *r) {
    return 2.0 * (r->x + r->y);
}
